#include<stdio.h>
/*
1、程序编译不会通过，这个程序中第一个注释符本来应该和最后的那个反注释符匹配的现在第一个注释符却和第一个反注释符匹配则第二个注释符就被注释掉了，第三个注释符将和第二个反注释符结合则多出的第三个反注释符为非法字符编译出错

2、把一个大型程序放在单一的一个源文件中优点：链接时间会减少，比较简单利与管理； 缺点：不利于调试，查找代码麻烦，不利于维护。

5、定义了一个整形变量xy

6、没有错误
*/

/*void Decide()
{
	char c;

	int i = 0;

	while(c=getchar() != EOF)
	{
		if(c == '{')
		{
			i++;
		}
		if(c == '}')
		{
			i--;
		}
		if(i < 0)
		{
			break;
		}
	}
	if(i = 0)
	{
		printf("正确");
	}
	else
		printf("错误");

}
int main()
{
	Decide();

	return 0;
}*/