/*
9、一般情况下如果不加sigend则系统默认会是有符号的，但如果加上sigend不管到那种机器上他的范围都是从负到正的。
10、signed char范围是 -128 — 127   unsigned char 范围是0 — 255 容纳的值可以变大但是容纳的数量不变
11、int类型的精度大，因为float类型第一位是代表符号位，然后八位是指数位，最后的23位是尾数为才能确定精度。而int类型有32位
15、错误的，局部变量不能用extern引用到其他函数中
16、还是错误的，静态变量更加不能用extern引用到其他函数中，静态变量只能在当前位置使用
17、不需要，在文件的开始就声明则则个变量是一个全局变量，全局变量在这个文件中的函数都可一直接使用不需要做别的声明
18、加上一个static则这个变量是一个静态全局变量，同样可以在此源文件的其他函数中使用，不需要其他声明，但此时的这个变量将不可以在别的文件被引用
19、需要加extern x;这样的声明。当引用其他文件的变量时需要加extern提前声明
20、加static则这个变量就是静态全局变量，此时只能在这个文件使用不能在别的文件进行引用
23、   
static char b = 2;
void y()
{

}

static int a=1;

void x()
{
	int c = 3;
	static float d = 4;
}


void main()
{
	y();
	x();
}
*/
